frontend/controllers/PageController.php

    public function actionView($slug) {
        $model = Page::find()->where([
            'slug' => $slug,
            'status' => Page::STATUS_PUBLISHED
        ])->one();
---
SELECT * FROM `page` WHERE (`slug`='about') AND (`status`=1)