common/widgets/DbMenu.php

    public function init() {
        $cacheKey = [
            WidgetMenu::class,
            $this->key
        ];
        $this->items = Yii::$app->cache->get($cacheKey);
        if ($this->items === false) {
            if (! ($model = WidgetMenu::findOne([
                'key' => $this->key,
                'status' => WidgetMenu::STATUS_ACTIVE
            ]))) {
---
SELECT * FROM `widget_menu` WHERE (`key`='frontend-index') AND (`status`=1)