common/widgets/DbText.php

SELECT * FROM `widget_text` WHERE (`key`='ads-example') AND (`status`=1)
---
    public function run() {
        $cacheKey = [
            WidgetText::class,
            $this->key
        ];
        $content = Yii::$app->cache->get($cacheKey);
        if (! $content) {
            $model = WidgetText::findOne([
                'key' => $this->key,
                'status' => WidgetText::STATUS_ACTIVE
            ]);